# GetIdsToExclude Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExclusionFilter..::..GetIdsToExclude Method
ExclusionFilter Class See Also
---
Returns the ids to be excluded by this filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetIdsToExclude()
```

Visual Basic
---
```text
Public Function GetIdsToExclude As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetIdsToExclude()
```

# ### Return Value
The collection of ids to exclude.
# See Also
ExclusionFilter Class
Autodesk.Revit.DB Namespace